/* 6. Написать программу, в результате работы которой выводятся на экран
первые 10 чисел гармонического ряда (форматировать вывод). */

package ru.mirea.lab1;

import java.util.*;
public class Task4 {
    public static void main(String[] args) {
        for (int i = 1; i < 11; i++) {
            System.out.println(1./i);
        }
    }
}
